PeriodicHill_FieldInversion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       6880;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          50;
        startFace       6930;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       6980;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       7050;
    }
    front
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3500;
        startFace       7120;
    }
    back
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3500;
        startFace       10620;
    }
)

// ************************************************************************* //
